<h1>Case Study по модулю SQL</h1>

<h4>ФИО: Абдуллаев Сайидазизхон Шухратович</h4>
<h8>Дата: 14.11.2024</h8>

<h1>Блок 1: Создание схемы и таблиц</h1>

In [ ]:
import pandas as pd
from connector import connect_to
from sqlalchemy import create_engine, text

In [54]:
engine = create_engine('postgresql://postgres:admin@localhost:5432/postgres')

In [55]:
file_path ='adventure_works.xlsx'
sheet_names = pd.ExcelFile(file_path).sheet_names

In [56]:
xls = pd.ExcelFile(file_path)

In [64]:
# Загрузка данных из каждого листа
customers_df = pd.read_excel(xls, sheet_name='Customers')
products_df = pd.read_excel(xls, sheet_name='Products')
territory_df = pd.read_excel(xls, sheet_name='Territory')
sales_df = pd.read_excel(xls, sheet_name='Sales')
product_category_df = pd.read_excel(xls, sheet_name='ProductCategory')
product_subcategory_df = pd.read_excel(xls, sheet_name='ProductSubCategory')

In [73]:
# Заливаем данные в PostgreSQL
customers_df.to_sql('customers', con=engine, schema='adv_works', if_exists='replace', index=False)
products_df.to_sql('products', con=engine, schema='adv_works', if_exists='replace', index=False)
territory_df.to_sql('territory', con=engine, schema='adv_works', if_exists='replace', index=False)
sales_df.to_sql('sales', con=engine, schema='adv_works', if_exists='replace', index=False)
product_category_df.to_sql('product_category', con=engine, schema='adv_works', if_exists='replace', index=False)
product_subcategory_df.to_sql('product_subcategory', con=engine, schema='adv_works', if_exists='replace', index=False)

37

<h1>Блок 2: Аналитические задачи</h1>

<h2>Секция 1. Анализ клиентов</h2>

<h7><b>1.</b> <i>Сегментация по доходу:</i> Посчитайте средний годовой личный доход клиентов (YearlyIncome) в разбивке по роду деятельности (Occupation). Итоговая таблица должна содержать следующие поля: occupation, number_of_customers, avg_income.</h7>

In [91]:
# Задача 1. Сегментация по доходу
query1 = """
SELECT
    occupation,
    COUNT(*) AS number_of_customers,
    AVG(yearly_income) AS avg_income
FROM 
    adv_works.customers
GROUP BY 
    occupation;
"""
result1 = pd.read_sql(query1, engine)
result1

       occupation  number_of_customers    avg_income
0      Management                 3075  92325.203252
1        Clerical                 2928  30710.382514
2          Manual                 2384  16451.342282
3  Skilled Manual                 4577  51715.097225
4    Professional                 5520  74184.782609

<h7> <b>2.</b> <i>Семейный профиль:</i> Посчитайте долю (в процентах) клиентов с детьми и долю клиентов без детей. Итоговая таблица должна содержать следующие поля: has_children (где 1 означает - имеет детей и 0 - не имеет детей), pct_of_customer_base.</h7>

In [82]:
# Задача 2. Семейный профиль
query2 = """
SELECT 
    CASE WHEN number_children_at_home > 0 THEN 1 ELSE 0 END AS has_children,
    ROUND((COUNT(*) * 100.0 / (SELECT COUNT(*) FROM adv_works.customers)), 2) AS pct_of_customer_base
FROM 
    adv_works.customers
GROUP BY 
    has_children;
"""

# Выполнение запроса
result2 = pd.read_sql(query2, engine)

# Вывод результата
result2

   has_children  pct_of_customer_base
0             0                 60.14
1             1                 39.86

<h7> <b>3.</b> <i>Высокодоходные клиенты:</i> Сформируйте список топ 10 клиентов с наибольшей суммой покупок (поле SalesAmount). Итоговая таблица должна содержать следующие поля: customer_key, customer_name, total_purchase.</h7>

In [81]:
# Задача 3. Высокодоходные клиенты
query3 = """
SELECT 
    c.customer_key, 
    c.name, 
    SUM(s.sales_amount) AS total_purchase
FROM 
    adv_works.sales AS s
JOIN 
    adv_works.customers AS c ON s.customer_key = c.customer_key
GROUP BY 
    c.customer_key, c.name
ORDER BY 
    total_purchase DESC
LIMIT 10;
"""

# Выполнение запроса
result3 = pd.read_sql(query3, engine)

# Вывод результата
result3

   customer_key               name  total_purchase
0         12301       Nichole Nara      13295.3800
1         12132  Kaitlyn Henderson      13294.2700
2         12308        Margaret He      13269.2700
3         12131  Randall Dominguez      13265.9900
4         12300   Adriana Gonzalez      13242.7000
5         12321            Rosa Hu      13215.6500
6         12124        Brandi Gill      13195.6400
7         12307           Brad She      13173.1900
8         12296     Francisco Sara      13164.6400
9         11433       Maurice Shan      12909.6682

<h7> <b>4.</b> <i>Влияние семейного положения:</i> Посчитайте среднюю сумму продаж в разбивке по семейному положению клиентов (MaritalStatus) и определите насколько сильно различаются средние суммы между двумя группами. Итоговая таблица должна содержать следующие поля: year, marital_status, avg_sales_amount.</h7>

In [84]:
# Задача 4. Влияние семейного положения
query4 = """
SELECT 
    EXTRACT(YEAR FROM s.order_date) AS year,
    c.marital_status, 
    AVG(s.sales_amount) AS avg_sales_amount
FROM 
    adv_works.sales AS s
JOIN 
    adv_works.customers AS c ON s.customer_key = c.customer_key
GROUP BY 
    year, c.marital_status
ORDER BY 
    year, c.marital_status;
"""

# Выполнение запроса
result4 = pd.read_sql(query4, engine)

# Вывод результата
result4

     year marital_status  avg_sales_amount
0  2001.0              M       3245.029003
1  2001.0              S       3203.841802
2  2002.0              M       2397.073268
3  2002.0              S       2482.128323
4  2003.0              M        378.559649
5  2003.0              S        427.775275
6  2004.0              M        290.636162
7  2004.0              S        318.047974

<h2>Секция 2: Анализ продаж </h2>

<h7><b>1.</b> <i>Ежемесячные продажи:</i> Создайте отчёт продаж по месяцам за последние 2 года (2003, 2004). Итоговая таблица должна содержать следующие поля: year, monthkey, month_name, sales_count (количество продаж), sales_amount.</h7>

In [90]:
query5 = """

SELECT
    EXTRACT(YEAR FROM order_date) AS year,
    EXTRACT(MONTH FROM order_date) AS monthkey,
    TO_CHAR(order_date, 'Month') AS month_name,
    COUNT(*) AS sales_count,
    SUM(sales_amount) AS sales_amount
FROM adv_works.sales
WHERE EXTRACT(YEAR FROM order_date) IN (2003, 2004)
GROUP BY
    EXTRACT(YEAR FROM order_date),
    EXTRACT(MONTH FROM order_date),
    TO_CHAR(order_date, 'Month')
ORDER BY year, monthkey;

"""


# Выполнение запроса
result4 = pd.read_sql(query5, engine)

# Вывод результата
result4

      year  monthkey month_name  sales_count  sales_amount
0   2003.0       1.0  January            244  4.388652e+05
1   2003.0       2.0  February           272  4.890903e+05
2   2003.0       3.0  March              272  4.855748e+05
3   2003.0       4.0  April              294  5.063993e+05
4   2003.0       5.0  May                335  5.627726e+05
5   2003.0       6.0  June               321  5.547992e+05
6   2003.0       7.0  July              1411  8.866688e+05
7   2003.0       8.0  August            3819  8.474135e+05
8   2003.0       9.0  September         3885  1.010258e+06
9   2003.0      10.0  October           4146  1.080450e+06
10  2003.0      11.0  November          4174  1.196981e+06
11  2003.0      12.0  December          5270  1.731788e+06
12  2004.0       1.0  January           4585  1.340245e+06
13  2004.0       2.0  February          4616  1.462480e+06
14  2004.0       3.0  March             4707  1.480905e+06
15  2004.0       4.0  April             5088  1.608751e+06
16  2004.0       5.0  May               5515  1.878318e+06
17  2004.0       6.0  June              5545  1.949361e+06
18  2004.0       7.0  July              2209  5.084063e+04

<h7>2. Продажи по регионам: Посчитайте сумму продаж в разбивке по регионам. Итоговая таблица должна содержать следующие поля: region, sales_count, sales_amount.</h7>

In [96]:
query6 = """

SELECT
    t.region,
    COUNT(s.*) AS sales_count,
    SUM(s.sales_amount) AS sales_amount
FROM adv_works.sales s
JOIN adv_works.territory t on s.sales_territory_key = t.territory__key
GROUP BY region
ORDER BY region;

"""


result6 = pd.read_sql(query6, engine)

result6

           region  sales_count  sales_amount
0       Australia        13345  9.061001e+06
1          Canada         7620  1.977845e+06
2         Central           20  3.000830e+03
3          France         5558  2.644018e+06
4         Germany         5625  2.894312e+06
5       Northeast           27  6.532468e+03
6       Northwest         8993  3.649867e+06
7       Southeast           39  1.223885e+04
8       Southwest        12265  5.718151e+06
9  United Kingdom         6906  3.391712e+06

<h2>Секция 3: Анализ продуктов</h2>

<h7>1. Доля продаж: Посчитайте какую долю от общих продаж составляет каждая категория продуктов. Итоговая таблица должна содержать следующие поля: year, product_key, product_category_key, english_product_category_name, sales_amount, pct_of_total_sales.</h7>

In [101]:
query7 = """
SELECT
    EXTRACT(YEAR FROM s.order_date) AS year,
    p.product_key,
    pc.product_category_key,
    pc.english_product_category_name,
    SUM(s.sales_amount) AS sales_amount,
    ROUND(SUM(s.sales_amount)::numeric * 100. / total_sales.total_sales_amount::numeric, 2) AS pct_of_total_sales
FROM adv_works.sales s
JOIN adv_works.products p ON s.product_key = p.product_key
JOIN adv_works.product_subcategory ps ON p.product_subcategory_key = ps.product_subcategory_key
JOIN adv_works.product_category pc ON ps.product_category_key = pc.product_category_key
JOIN (
    SELECT
        EXTRACT(YEAR FROM order_date) AS year,
        SUM(sales_amount) AS total_sales_amount
    FROM adv_works.sales
    GROUP BY EXTRACT(YEAR FROM order_date)
) total_sales ON EXTRACT(YEAR FROM s.order_date) = total_sales.year
GROUP BY
    EXTRACT(YEAR FROM s.order_date),
    p.product_key,
    pc.product_category_key,
    pc.english_product_category_name,
    total_sales.total_sales_amount
ORDER BY year, pc.product_category_key;
"""


result7 = pd.read_sql(query7, engine)

result7

,year,product_key,product_category_key,english_product_category_name,sales_amount,pct_of_total_sales
0,2001.0,310,1,Bikes,593992.82,18.19
1,2001.0,311,1,Bikes,500957.80,15.34
2,2001.0,312,1,Bikes,547475.31,16.76
3,2001.0,313,1,Bikes,472331.64,14.46
4,2001.0,314,1,Bikes,486644.72,14.90
...,...,...,...,...,...,...
311,2004.0,537,4,Accessories,28560.00,0.29
312,2004.0,538,4,Accessories,13065.92,0.13
313,2004.0,539,4,Accessories,13319.67,0.14
314,2004.0,540,4,Accessories,15093.80,0.15
315,2004.0,541,4,Accessories,16872.18,0.17

<h7>2. Самые продаваемые продукты: Определите топ 5 продуктов с наибольшей суммой продаж. Итоговая таблица должна содержать следующие поля: product_key, product_name, english_product_category_name, sales_amount</h7>

In [103]:
query8 = """
SELECT
    p.product_key,
    p.product_name,
    pc.english_product_category_name,
    SUM(s.sales_amount) AS sales_amount
FROM adv_works.sales s
JOIN adv_works.products p ON s.product_key = p.product_key
JOIN adv_works.product_subcategory ps ON p.product_subcategory_key = ps.product_subcategory_key
JOIN adv_works.product_category pc ON ps.product_category_key = pc.product_category_key
GROUP BY
    p.product_key,
    p.product_name,
    pc.english_product_category_name
ORDER BY sales_amount DESC
LIMIT 5;

"""

result8 = pd.read_sql(query8, engine) 

result8

   product_key      product_name english_product_category_name  sales_amount
0          312  Road-150 Red, 48                         Bikes    1205876.99
1          310  Road-150 Red, 62                         Bikes    1202298.72
2          313  Road-150 Red, 52                         Bikes    1080637.54
3          314  Road-150 Red, 56                         Bikes    1055589.65
4          311  Road-150 Red, 44                         Bikes    1005493.87

<h7>3. Маржа от продаж: Посчитайте разницу между суммой продаж (SalesAmount) за минусом себестоимости (TotalProductCost), налогов (*TaxAmt) и расходов на доставку (Freight) по каждому продукту в разбивке по годам и месяцам. Итоговая таблица должна содержать следующие поля: year, monthkey, month_name, product_key, product_name, sales_amount, total_product_cost, tax_amt, freight, margin, margin_pct (маржа как процент от суммы продаж).</h7>

In [104]:
query9 = """
SELECT
    EXTRACT(YEAR FROM s.order_date) AS year,
    EXTRACT(MONTH FROM s.order_date) AS monthkey,
    TO_CHAR(s.order_date, 'FMMonth') AS month_name,
    p.product_key,
    p.product_name,
    SUM(s.sales_amount) AS sales_amount,
    SUM(s.total_product_cost) AS total_product_cost,
    SUM(s.tax_amt) AS tax_amt,
    SUM(s.freight) AS freight,
    SUM(s.sales_amount) - SUM(s.total_product_cost) - SUM(s.tax_amt) - SUM(s.freight) AS margin,
    ROUND((SUM(s.sales_amount)::numeric - SUM(s.total_product_cost)::numeric - SUM(s.tax_amt)::numeric - SUM(s.freight))::numeric * 100.0 / SUM(s.sales_amount)::numeric, 2) AS margin_pct
FROM adv_works.sales s
JOIN adv_works.products p ON s.product_key = p.product_key
GROUP BY
    EXTRACT(YEAR FROM s.order_date),
    EXTRACT(MONTH FROM s.order_date),
    TO_CHAR(s.order_date, 'FMMonth'),
    p.product_key,
    p.product_name
ORDER BY year, monthkey, p.product_key;

"""


result9 = pd.read_sql(query9, engine)

result9

,year,monthkey,month_name,product_key,product_name,sales_amount,total_product_cost,tax_amt,freight,margin,margin_pct
0,2001.0,7.0,July,310,"Road-150 Red, 62",78721.94,47768.4724,6297.7552,1968.0496,22687.6628,28.82
1,2001.0,7.0,July,311,"Road-150 Red, 44",82300.21,49939.7666,6584.0168,2057.5064,23718.9202,28.82
2,2001.0,7.0,July,312,"Road-150 Red, 48",100191.56,60796.2376,8015.3248,2504.7904,28875.2072,28.82
3,2001.0,7.0,July,313,"Road-150 Red, 52",42939.24,26055.5304,3435.1392,1073.4816,12375.0888,28.82
4,2001.0,7.0,July,314,"Road-150 Red, 56",53674.05,32569.4130,4293.9240,1341.8520,15468.8610,28.82
...,...,...,...,...,...,...,...,...,...,...,...
1895,2004.0,7.0,July,537,HL Mountain Tire,2275.00,850.8500,182.0000,56.8750,1185.2750,52.10
1896,2004.0,7.0,July,538,LL Road Tire,1375.36,514.3872,110.0288,34.3872,716.5568,52.10
1897,2004.0,7.0,July,539,ML Road Tire,899.64,336.4668,71.9712,22.4928,468.7092,52.10
1898,2004.0,7.0,July,540,HL Road Tire,1760.40,658.3896,140.8320,44.0100,917.1684,52.10
1899,2004.0,7.0,July,541,Touring Tire,1565.46,585.4842,125.2368,39.1392,815.5998,52.10

<h2>Секция 4. Анализ трендов</h2>

<h7>1. Квартальный рост: Посчитайте сумму продаж за каждый квартал и их процентное изменение по топ 2 наиболее продаваемым категориям. Итоговая таблица должна содержать следующие поля: year, quarter_id, product_category_key, english_product_category_name, quarter_sales_amount, quarter_over_quarter_growth_pct. </h7>

In [109]:
query10 = """
WITH top_categories AS (
    SELECT
        pc.product_category_key,
        pc.english_product_category_name,
        EXTRACT(YEAR FROM s.order_date) AS year,
        CEIL(EXTRACT(MONTH FROM s.order_date) / 3) AS quarter_id, -- Определяем квартал
        SUM(s.sales_amount) AS quarter_sales_amount
    FROM adv_works.sales s
    JOIN adv_works.products p ON s.product_key = p.product_key
    JOIN adv_works.product_subcategory ps ON p.product_subcategory_key = ps.product_subcategory_key
    JOIN adv_works.product_category pc ON ps.product_category_key = pc.product_category_key
    GROUP BY
        pc.product_category_key,
        pc.english_product_category_name,
        EXTRACT(YEAR FROM s.order_date),
        CEIL(EXTRACT(MONTH FROM s.order_date) / 3)
),
top_2_categories AS (
    SELECT product_category_key
    FROM top_categories
    GROUP BY product_category_key
    ORDER BY SUM(quarter_sales_amount) DESC
    LIMIT 2
)
SELECT
    t.year,
    t.quarter_id,
    t.product_category_key,
    t.english_product_category_name,
    ROUND(SUM(t.quarter_sales_amount)::numeric) AS quarter_sales_amount,
    ROUND(
        (SUM(t.quarter_sales_amount)::numeric - LAG(SUM(t.quarter_sales_amount)::numeric) OVER (PARTITION BY t.product_category_key ORDER BY t.year, t.quarter_id)) * 100.0 / 
        NULLIF(LAG(SUM(t.quarter_sales_amount)::numeric) OVER (PARTITION BY t.product_category_key ORDER BY t.year, t.quarter_id), 0),
        2
    ) AS quarter_over_quarter_growth_pct
FROM top_categories t
WHERE t.product_category_key IN (SELECT product_category_key FROM top_2_categories)
GROUP BY
    t.year,
    t.quarter_id,
    t.product_category_key,
    t.english_product_category_name
ORDER BY t.year, t.quarter_id, t.product_category_key;
"""

result10 = pd.read_sql(query10, engine)

result10

,year,quarter_id,product_category_key,english_product_category_name,quarter_sales_amount,quarter_over_quarter_growth_pct
0,2001.0,3.0,1,Bikes,1453523.0,NaN
1,2001.0,4.0,1,Bikes,1812851.0,24.72
2,2002.0,1.0,1,Bikes,1791698.0,-1.17
3,2002.0,2.0,1,Bikes,2014012.0,12.41
4,2002.0,3.0,1,Bikes,1396834.0,-30.64
5,2002.0,4.0,1,Bikes,1327799.0,-4.94
6,2003.0,1.0,1,Bikes,1413530.0,6.46
7,2003.0,2.0,1,Bikes,1623971.0,14.89
8,2003.0,3.0,1,Bikes,2569678.0,58.23
9,2003.0,3.0,4,Accessories,118675.0,NaN
10,2003.0,4.0,1,Bikes,3751923.0,46.01
11,2003.0,4.0,4,Accessories,175035.0,47.49
12,2004.0,1.0,1,Bikes,4024025.0,7.25
13,2004.0,1.0,4,Accessories,173551.0,-0.85
14,2004.0,2.0,1,Bikes,5138299.0,27.69
15,2004.0,2.0,4,Accessories,199755.0,15.10
16,2004.0,3.0,4,Accessories,33745.0,-83.11

<h7>2. Сравнение будних и выходных (суббота, воскресенье) дней: Посчитайте продажи в разбивке по годам и дням недели. Определите в какие дни в среднем сумма продаж больше. Определите является ли сумма продаж больше в будние или выходные дни. Итоговая таблица должна содержать следующие поля: year, day_name, is_weekend (где 1 означает выходной а 0 будний день), sales_amount.</h7>

In [108]:
query11 = """
SELECT
    EXTRACT(YEAR FROM s.order_date) AS year,
    TO_CHAR(s.order_date, 'FMDay') AS day_name,
    CASE 
        WHEN EXTRACT(DOW FROM s.order_date) IN (0, 6) THEN 1 -- 0 = Sunday, 6 = Saturday
        ELSE 0
    END AS is_weekend,
    ROUND(SUM(s.sales_amount)::numeric, 2) AS sales_amount
FROM adv_works.sales s
GROUP BY
    EXTRACT(YEAR FROM s.order_date),
    TO_CHAR(s.order_date, 'FMDay'),
    CASE 
        WHEN EXTRACT(DOW FROM s.order_date) IN (0, 6) THEN 1
        ELSE 0
    END
ORDER BY year, is_weekend DESC, day_name;

"""

result11 = pd.read_sql(query11, engine)

result11

      year   day_name  is_weekend  sales_amount
0   2001.0   Saturday           1     505234.58
1   2001.0     Sunday           1     526026.82
2   2001.0     Friday           0     468724.50
3   2001.0     Monday           0     447197.10
4   2001.0   Thursday           0     450281.09
5   2001.0    Tuesday           0     433609.42
6   2001.0  Wednesday           0     435300.15
7   2002.0   Saturday           1     915346.19
8   2002.0     Sunday           1     937525.27
9   2002.0     Friday           0     856241.81
10  2002.0     Monday           0     919784.70
11  2002.0   Thursday           0     956084.69
12  2002.0    Tuesday           0     941228.27
13  2002.0  Wednesday           0    1004132.60
14  2003.0   Saturday           1    1441620.84
15  2003.0     Sunday           1    1383816.88
16  2003.0     Friday           0    1451113.39
17  2003.0     Monday           0    1359434.96
18  2003.0   Thursday           0    1392997.58
19  2003.0    Tuesday           0    1374749.52
20  2003.0  Wednesday           0    1387327.14
21  2004.0   Saturday           1    1480472.42
22  2004.0     Sunday           1    1384272.59
23  2004.0     Friday           0    1459306.10
24  2004.0     Monday           0    1428502.83
25  2004.0   Thursday           0    1314385.26
26  2004.0    Tuesday           0    1403505.68
27  2004.0  Wednesday           0    1300454.86